// final List majorList = [
//   //무도대학
//   '유도학과',
//   '유도경기지도학과'
// ];

const Map<String, int> majorList = {
  //무도대학
  '유도학과': 01,
  '유도경기지도학과': 38,
  '무도스포츠학과': 26,
  '동양무예학과': 27,
  '태권도학과': 03,
  '경호학과': 16,
  '군사학과': 44,
  // 체육과학대학
  '스포츠레저학과': 04,
  '체육학과': 09,
  '골프학과': 22,
  '특수체육교육과': 28,
  // 문화예술대학
  '무용과': 05,
  '미디어디자인학과': 85,
  '회화학과': 13,
  '연극학과': 18,
  '실용음악과': 89,
  '국악과': 17,
  '영화영상학과': 83,
  '문화재학과': 20,
  '문화콘텐츠학과': 86,
  // AI융합대학
  '경영학과': 07,
  '관광경영학과': 11,
  '경영정보학과': 19,
  '경찰행정학과': 23,
  '중국학과': 24,
  '영어과': 76,
  '미용경영학과': 77,
  'AI학부': 78,
  '컴퓨터과학과': 33,
  '물류통계정보학과': 57,
  // 보건복지과학대학
  '산업환경보건학과': 35,
  '환경학과': 36,
  '생명과학과': 15,
  '식품조리학부': 79,
  '물리치료학과': 25,
  '사회복지학과': 88,
  // 학과코드를 알 수 없는 학과
  '격기지도학과': 1,
  '태권도경기지도학과': 2,
  '문화관광학과': 3,
  '식품영양학과': 4,
  '뷰티헬스케어학과': 5,
  '뷰티케어학과': 6,
};
